# Проект "Веб-приложение по бронированию"

Необходимо в команде до 5 человек на любом языке, поддерживающим объектно-ориентированное программирование и фремворки для веб-разработки, реализовать веб-приложение с механикой бронирования (запись к врачу, забронировать номер и т.д.). 
Можете использовать ту же предметную область, что во втором проекте. Вы должны ориентироваться на требования и рамки, которые описаны ниже, но предметную область, 
внешний вид, язык программирования, иерархию классов в коде вы определяете командой сами.
Можно использовать веб-фремворки для бэкенда и фронтенда, можно использовать ORM для баз данных.
Веб-приложение будете показывать на локалхосте, деплоить на сервер не надо.
На бэкенде должна быть бизнес-логика, роутинг, обработка данных с фронта.
На фронтенде должен быть удобный интерфейс пользователя, приятный внешний вид. То есть требования к внешнему виду фронта - как на сайте визитке.

## Основные требования к проекту (уровень 1)
1. Реализация проекта в виде веб-приложения (динамический сайт, SPA и т.д.)
2. Реализация механики бронирования / записи на какую-то дату / время чего-то / на что-то
3. Реализация хранения информации в базе данных (можно и нужно использовать ORM, инструменты языка и веб-фреймворка)
4. Адаптация веб-приложения под desktop
5. Семантические теги (header, main, nav, article и т.д.)
6. Бронирование или запись минимум трёх видов сущностей, которые будут иметь влияние на логику работы информационной системы
7. Вводимые данные проверяться на валидность согласно предметной области и здравого смысла как на фронте, так и на бэке.

## Дополнительные требования к проекту (уровень 2)
1. Адаптация под desktop и mobile
2. Адекватная структура каталогов проекта (картинки в images, разбиение по модулям и т.д.)
3. Две роли - пользователь и администратор информационной системы с соответствующим набором действий, продиктованных предметной областью и механикой бронирования / записи для неё
4. Ведение проекта на Github

## Оценивание проекта
1. Он работает
2. Выполнены основные и дополнительные требования к проекту хотя бы формально
3. Работа в команде, разделены задачи / блоки проекта между участниками команды, история ведения задач закреплена (например, в Trello или Kaiten), каждый может рассказать про свои задачи и результаты по ним
4. Полная оценка за проект - 30 баллов. За каждое нереализованное требование минус 2 балла
5. Срок 19 - 24 июня в соответствии с расписанием подгрупп. Далее штраф по -4 балла за каждую неделю просрочки. Можно уйти в минус
6. Если в срок показали, но не все требования реализованы, может быть дано 2 недели, но за них уже будет по 1 баллу начислено, а не по 2
7. Баллы оценивания могут поменяться, но принципы нет


